/* --- home task 12 --- */
/* 
Присвоєння цього автомобіля власнику (записати в автомобіль об'єкт власника)
Усі дані про людину та про автомобіль отримувати від користувача. Реалізувати необхідні перевірки на коректність введення (порожні поля, вік >18 в людини і т.д. у разі потреби).
Максимально використовувати функції */
const car = new Car('Toyota', 'Camry')

const owner = new Man('Іван', 30)

car.owner = owner

console.log('Дані про авто:')
car.showCar()

console.log('Дані про власника:')
car.owner.showMan()
