/* --- home task 5 --- */
// Вивести на сторінку в один рядок через кому числа від 10 до 20

for (let i = 10; i <= 20; i++) {
  console.log(i + ', ')
}
// Вивести квадрати чисел від 10 до 20

for (let i = 10; i <= 20; i++) {
  console.log(i * i)
}

// Вивести таблицю множення на 7

for (let i = 1; i < 10; i++) {
  console.log(` 7 * ${i} = ${7 * i}`)
}
// Знайти суму всіх цілих чисел від 1 до 15
let sum = 0
for (let i = 1; i <= 15; i++) {
  sum += i
}
console.log(sum)

// Знайти добуток усіх цілих чисел від 15 до 35

let product = 1
for (let i = 15; i <= 35; i++) {
  product *= i
}
console.log(product)

// Знайти середнє арифметичне всіх цілих чисел від 1 до 500

let count = 0
let sum500 = 0
let avg = 0
for (let i = 1; i <= 500; i++) {
  count++
  sum500 += i
  avg = sum500 / count
}
console.log(avg)

// Вивести суму лише парних чисел у діапазоні від 30 до 80

let sumEven = 0
for (let i = 30; i <= 80; i++) {
  if (i % 2 === 0) {
    sumEven += i
  }
}
console.log(sumEven)

// Вивести всі числа в діапазоні від 100 до 200, які кратні 3

for (let i = 100; i <= 300; i++) {
  if (i % 3 === 0) {
    console.log(i)
  }
}

// Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// Визначити кількість його парних дільників
// Знайти суму його парних дільників

let naturalNum = 56
let evenCountNaturalNum = 0
let sumNaturalNum = 0
for (let i = 0; i <= naturalNum; i++) {
  if (naturalNum % i === 0) {
    console.log(i)
    if (i % 2 === 0) {
      evenCountNaturalNum++
      sumNaturalNum += i
    }
  }
}
console.log(evenCountNaturalNum)
console.log(sumNaturalNum)

// Надрукувати повну таблицю множення від 1 до 10

for (let i = 1; i < 10; i++) {
  for (let j = 1; j < 10; j++) {
    console.log(`${i} * ${j} = ${i * j}`)
  }
}

/* --- home task 6 --- */
/* Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)
Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
Дано ціле число. З'ясувати, чи воно простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе).
Дано деяке число. Ваше завдання – визначити, чи можна отримати це число, піднявши число 3 до певного натурального ступеня. (Як приклад, числа 9 та 81 можна отримати цим способом, але 13 – ні.) */
