/* --- home task 5 --- */
/* Вивести на сторінку в один рядок через кому числа від 10 до 20
Вивести квадрати чисел від 10 до 20
Вивести таблицю множення на 7
Знайти суму всіх цілих чисел від 1 до 15
Знайти добуток усіх цілих чисел від 15 до 35
Знайти середнє арифметичне всіх цілих чисел від 1 до 500
Вивести суму лише парних чисел у діапазоні від 30 до 80
Вивести всі числа в діапазоні від 100 до 200, які кратні 3
Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
Визначити кількість його парних дільників
Знайти суму його парних дільників
Надрукувати повну таблицю множення від 1 до 10 */

/* --- home task 6 --- */
/* Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)
Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
Дано ціле число. З'ясувати, чи воно простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе).
Дано деяке число. Ваше завдання – визначити, чи можна отримати це число, піднявши число 3 до певного натурального ступеня. (Як приклад, числа 9 та 81 можна отримати цим способом, але 13 – ні.) */
