/* --- home task 3 --- */
/* Дано два різні числа. Визначити, яке з них більше, а яке менше.
Відомі дві відстані. Одне у кілометрах, інше – у футах (1 фут = 0,305м). Яка відстань менша?
Визначити, чи є число a дільником числа b? І навпаки. (Дати дві відповіді)
Дано число. Визначити, чи закінчується воно парною цифрою чи непарною? Вивести останню цифру.
Дано двозначне число. Визначити, яка з його цифр більша: перша чи друга?
Дано тризначне число.
Визначити чи є парною сума його цифр.
Визначити, чи кратна сума цифр п'яти.
Визначити чи є добуток його цифр більше 100.
Дано тризначне число.
Чи правда, що всі цифри однакові?
Чи є серед цифр цифри однакові?
Визначити, чи є задане шестизначне число дзеркальним? (123321, 147741) */
/* --- home task 4 --- */
/* Запросити у користувача рік народження.

Запитати в нього, в якому місті він живе.

Запитати його улюблений вид спорту.

При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

Його вік.
Якщо користувач запровадить Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач запровадить один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати…” і підставляємо на місце точок ім'я та прізвище чемпіона.
 

Все це має бути відображено в одному вікні (алерті).

Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення - "Шкода, що Ви не захотіли ввести свій(ю) ..." і вказуємо, що він не захотів вводити - дату народження, місто або вид спорту. */
